<template>
  <h1>Новая категория постов</h1>

  <form action="">
    <input type="text" placeholder="Название категории" />
    <button>Добавить категорию "Название появляется при вводе"</button>
    <h3>Посты без категории</h3>
    <ul>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
      <li>
        Название поста <a href="">добавить этот пост в новую категорию</a>
      </li>
    </ul>
  </form>
</template>
