<template>
  <article>
    <h1>Паттерн фабрика</h1>
    <p>
      <strong
        ><i
          >Фабричный метод — это порождающий паттерн проектирования, который
          определяет общий интерфейс для создания объектов в суперклассе,
          позволяя подклассам изменять тип создаваемых объектов.
        </i></strong
      >
    </p>
    <hr />

    <section>
      <p>
        Представьте, что вы создаёте программу управления грузовыми перевозками.
        Сперва вы рассчитываете перевозить товары только на автомобилях. Поэтому
        весь ваш код работает с объектами класса Грузовик.
      </p>
      <p>
        В какой-то момент ваша программа становится настолько известной, что
        морские перевозчики выстраиваются в очередь и просят добавить поддержку
        морской логистики в программу.
      </p>
      <p>
        Паттерн Фабричный метод предлагает создавать объекты не напрямую,
        используя оператор new, а через вызов особого фабричного метода. Не
        пугайтесь, объекты всё равно будут создаваться при помощи new, но делать
        это будет фабричный метод.
      </p>
      <p>
        На первый взгляд, это может показаться бессмысленным: мы просто
        переместили вызов конструктора из одного конца программы в другой. Но
        теперь вы сможете переопределить фабричный метод в подклассе, чтобы
        изменить тип создаваемого продукта.
      </p>
      <p>
        Чтобы эта система заработала, все возвращаемые объекты должны иметь
        общий интерфейс. Подклассы смогут производить объекты различных классов,
        следующих одному и тому же интерфейсу.
      </p>
    </section>
    <hr />
    <dl>
      <dt>Источник:</dt>
      <dd>
        <a href="https://refactoring.guru/ru/design-patterns/factory-method"
          >Рефакторинг.Гуру</a
        >
      </dd>
      <dt>Пост создан:</dt>
      <dd>12.12.2022</dd>
      <dt>Изменён в последний раз:</dt>
      <dd>16.12.2022</dd>
      <dt>Добавили себе в избранное:</dt>
      <dd>
        <router-link to="/user">Laika</router-link>,
        <router-link to="/user">burzuy</router-link>
      </dd>
    </dl>

    <router-link to="/edit-post">Изменить</router-link> /
    <router-link to="/post"
      >Добавить в избранное (если пост другого пользователя)</router-link
    >
  </article>
</template>
