<template>
  <h1>Редактирование поста "Паттерн фабрика"</h1>

  <form action="">
    <table>
      <tr>
        <td colspan="2">
          <label>Название поста</label>
          <input
            type="text"
            placeholder="Название поста"
            value="Паттерн фабрика"
          />
        </td>
      </tr>
      <tr>
        <td>
          <label for="new-category">Названия категорий через запятую</label>
          <input
            list="list-of-categories"
            id="new-category"
            name="new-category"
            placeholder="Название категории"
            value="Паттерны проектирования"
          />
          <datalist id="list-of-categories">
            <option value="JavaScript" />
            <option value="React" />
            <option value="Хуки" />
            <option value="Что то ещё" />
          </datalist>
        </td>
        <td>
          <label>Краткое описание</label>
          <textarea
            name=""
            id=""
            cols="30"
            rows="10"
            placeholder="Краткое описание"
            style="height: 100px"
          >
Фабричный метод — это порождающий паттерн проектирования, который определяет общий интерфейс для создания объектов в суперклассе, позволяя подклассам изменять тип создаваемых объектов.
            </textarea
          >
        </td>
      </tr>
      <tr>
        <td colspan="2">
          <label>Содержимое поста</label>
          <textarea
            name=""
            id=""
            cols="30"
            rows="10"
            placeholder="Здесь будет содержимое вашего поста"
          >
Суть паттерна
Фабричный метод — это порождающий паттерн проектирования, который определяет общий интерфейс для создания объектов в суперклассе, позволяя подклассам изменять тип создаваемых объектов.

Проблема
Представьте, что вы создаёте программу управления грузовыми перевозками. Сперва вы рассчитываете перевозить товары только на автомобилях. Поэтому весь ваш код работает с объектами класса Грузовик.

В какой-то момент ваша программа становится настолько известной, что морские перевозчики выстраиваются в очередь и просят добавить поддержку морской логистики в программу.

Решение
Паттерн Фабричный метод предлагает создавать объекты не напрямую, используя оператор new, а через вызов особого фабричного метода. Не пугайтесь, объекты всё равно будут создаваться при помощи new, но делать это будет фабричный метод.

На первый взгляд, это может показаться бессмысленным: мы просто переместили вызов конструктора из одного конца программы в другой. Но теперь вы сможете переопределить фабричный метод в подклассе, чтобы изменить тип создаваемого продукта.

Чтобы эта система заработала, все возвращаемые объекты должны иметь общий интерфейс. Подклассы смогут производить объекты различных классов, следующих одному и тому же интерфейсу.
    </textarea
          >
        </td>
      </tr>
      <tr>
        <td colspan="2">
          <label for="weblink"
            >Также вы можете указать откуда взяли данную информацию</label
          >
          <input
            id="weblink"
            type="url"
            placeholder="ссылка на источник"
            value="https://refactoring.guru/ru/design-patterns/factory-method"
          />
        </td>
      </tr>
      <tr>
        <td colspan="2">
          <router-link to="/post">Отменить</router-link> |
          <router-link to="/post">Сохранить</router-link>
        </td>
      </tr>
    </table>
  </form>
</template>
